wolaite2024/jlab-jh5003-earphone/src/mcu/rtl87x3/arm/startup_rtl87x3d_gcc.s
  .word    ADP_IN_DET_Handler
  .word    ADP_OUT_DET_Handler
  .word    GPIOA2_Handler
  .word    GPIOA3_Handler
  .word    GPIOA4_Handler
  .word    GPIOA5_Handler
  .word    GPIOA6_Handler
  .word    GPIOA7_Handler
  .word    GPIOA8_Handler
  .word    GPIOA9_Handler
  .word    GPIOA10_Handler
  .word    GPIOA11_Handler
  .word    GPIOA12_Handler
  .word    GPIOA13_Handler
  .word    GPIOA14_Handler
  .word    GPIOA15_Handler
  .word    GPIOA16_Handler
  .word    GPIOA17_Handler
  .word    GPIOA18_Handler
  .word    GPIOA19_Handler
  .word    GPIOA20_Handler
  .word    GPIOA21_Handler
  .word    GPIOA22_Handler
  .word    GPIOA23_Handler
  .word    GPIOA24_Handler
  .word    GPIOA25_Handler
  .word    GPIOA26_Handler
  .word    GPIOA27_Handler
  .word    GPIOA28_Handler
  .word    GPIOA29_Handler
  .word    GPIOA30_Handler
  .word    GPIOA31_Handler
  .word    GPIOB0_Handler
  .word    GPIOB1_Handler
  .word    GPIOB2_Handler
  .word    GPIOB3_Handler
  .word    GPIOB4_Handler
  .word    GPIOB5_Handler
  .word    GPIOB6_Handler
  .word    GPIOB7_Handler
  .word    GPIOB8_Handler
  .word    GPIOB9_Handler
  .word    GPIOB10_Handler
  .word    GPIOB11_Handler
  .word    GPIOB12_Handler
  .word    GPIOB13_Handler
  .word    GPIOB14_Handler
  .word    GPIOB15_Handler
  .word    GPIOB16_Handler
  .word    GPIOB17_Handler
  .word    GPIOB18_Handler
  .word    GPIOB19_Handler
  .word    GPIOB20_Handler
  .word    GPIOB21_Handler
  .word    GPIOB22_Handler
  .word    GPIOB23_Handler
  .word    GPIOB24_Handler
  .word    GPIOB25_Handler
  .word    GPIOB26_Handler
  .word    GPIOB27_Handler
  .word    GPIOB28_Handler
  .word    GPIOB29_Handler
  .word    GPIOB30_Handler
  .word    GPIOB31_Handler
  .word    GPIOC0_Handler
  .word    GPIOC1_Handler
  .word    GPIOC2_Handler
  .word    GPIOC3_Handler
  .word    GPIOC4_Handler
  .word    GPIOC5_Handler
  .word    GPIOC6_Handler
  .word    GPIOC7_Handler
  .word    GPIOC8_Handler
  .word    GPIOC9_Handler
  .word    GPIOC10_Handler
  .word    GPIOC11_Handler
  .word    GPIOC12_Handler
  .word    GPIOC13_Handler
  .word    GPIOC14_Handler
  .word    GPIOC15_Handler
/**
**===========================================================================
** Provide weak aliases for each Exception handler to the Default_Handler.
**===========================================================================
*/

.weak NMI_Handler
.thumb_set NMI_Handler, Default_Handler

.weak HardFault_Handler
.thumb_set HardFault_Handler, Default_Handler

.weak MemManage_Handler
.thumb_set MemManage_Handler, Default_Handler

.weak BusFault_Handler
.thumb_set BusFault_Handler, Default_Handler

.weak UsageFault_Handler
.thumb_set UsageFault_Handler, Default_Handler

.weak Reserved_Handler_1
.thumb_set Reserved_Handler_1, Default_Handler

.weak Reserved_Handler_2
.thumb_set Reserved_Handler_2, Default_Handler

.weak Reserved_Handler_3
.thumb_set Reserved_Handler_3, Default_Handler

.weak Reserved_Handler_4
.thumb_set Reserved_Handler_4, Default_Handler

.weak SVC_Handler
.thumb_set SVC_Handler, Default_Handler

.weak DebugMon_Handler
.thumb_set DebugMon_Handler, Default_Handler

.weak Reserved_Handler_5
.thumb_set Reserved_Handler_5, Default_Handler

.weak PendSV_Handler
.thumb_set PendSV_Handler, Default_Handler

.weak SysTick_Handler
.thumb_set SysTick_Handler, Default_Handler


.weak System_Handler
.thumb_set System_Handler, Default_Handler

.weak WDT_Handler
.thumb_set WDT_Handler, Default_Handler

.weak BTMAC_Handler
.thumb_set BTMAC_Handler, Default_Handler

.weak USB_IP_Handler
.thumb_set USB_IP_Handler, Default_Handler

.weak TIM2_Handler
.thumb_set TIM2_Handler, Default_Handler

.weak Platform_Handler
.thumb_set Platform_Handler, Default_Handler

.weak I2S0_TX_Handler
.thumb_set I2S0_TX_Handler, Default_Handler

.weak I2S0_RX_Handler
.thumb_set I2S0_RX_Handler, Default_Handler

.weak UART2_Handler
.thumb_set UART2_Handler, Default_Handler

.weak GPIOA0_Handler
.thumb_set GPIOA0_Handler, Default_Handler

.weak GPIOA1_Handler
.thumb_set GPIOA1_Handler, Default_Handler

.weak UART1_Handler
.thumb_set UART1_Handler, Default_Handler

.weak UART0_Handler
.thumb_set UART0_Handler, Default_Handler

.weak RTC_Handler
.thumb_set RTC_Handler, Default_Handler

.weak SPI0_Handler
.thumb_set SPI0_Handler, Default_Handler

.weak SPI1_Handler
.thumb_set SPI1_Handler, Default_Handler

.weak I2C0_Handler
.thumb_set I2C0_Handler, Default_Handler

.weak I2C1_Handler
.thumb_set I2C1_Handler, Default_Handler

.weak ADC_Handler
.thumb_set ADC_Handler, Default_Handler

.weak Peripheral_Handler
.thumb_set Peripheral_Handler, Default_Handler

.weak GDMA0_Channel0_Handler
.thumb_set GDMA0_Channel0_Handler, Default_Handler

.weak GDMA0_Channel1_Handler
.thumb_set GDMA0_Channel1_Handler, Default_Handler

.weak GDMA0_Channel2_Handler
.thumb_set GDMA0_Channel2_Handler, Default_Handler

.weak GDMA0_Channel3_Handler
.thumb_set GDMA0_Channel3_Handler, Default_Handler

.weak GDMA0_Channel4_Handler
.thumb_set GDMA0_Channel4_Handler, Default_Handler

.weak GDMA0_Channel5_Handler
.thumb_set GDMA0_Channel5_Handler, Default_Handler

.weak KeyScan_Handler
.thumb_set KeyScan_Handler, Default_Handler

.weak QDEC_Handler
.thumb_set QDEC_Handler, Default_Handler

.weak IR_Handler
.thumb_set IR_Handler, Default_Handler

.weak DSP_Handler
.thumb_set DSP_Handler, Default_Handler

.weak GDMA0_Channel6_Handler
.thumb_set GDMA0_Channel6_Handler, Default_Handler

.weak GDMA0_Channel7_Handler
.thumb_set GDMA0_Channel7_Handler, Default_Handler

.weak GDMA0_Channel8_Handler
.thumb_set GDMA0_Channel8_Handler, Default_Handler

.weak GDMA0_Channel9_Handler
.thumb_set GDMA0_Channel9_Handler, Default_Handler

.weak GDMA0_Channel10_Handler
.thumb_set GDMA0_Channel10_Handler, Default_Handler

.weak GDMA0_Channel11_Handler
.thumb_set GDMA0_Channel11_Handler, Default_Handler

.weak GDMA0_Channel12_Handler
.thumb_set GDMA0_Channel12_Handler, Default_Handler

.weak GDMA0_Channel13_Handler
.thumb_set GDMA0_Channel13_Handler, Default_Handler

.weak GDMA0_Channel14_Handler
.thumb_set GDMA0_Channel14_Handler, Default_Handler

