wolaite2024/jlab-jh5003-earphone/src/mcu/rtl87x3/arm/startup_rtl87x3d_gcc.s
.weak GDMA0_Channel15_Handler
.thumb_set GDMA0_Channel15_Handler, Default_Handler

.weak TIM3_Handler
.thumb_set TIM3_Handler, Default_Handler

.weak TIM4_Handler
.thumb_set TIM4_Handler, Default_Handler

.weak TIM5_Handler
.thumb_set TIM5_Handler, Default_Handler

.weak TIM6_Handler
.thumb_set TIM6_Handler, Default_Handler

.weak TIM7_Handler
.thumb_set TIM7_Handler, Default_Handler

.weak TIM8to11_Handler
.thumb_set TIM8to11_Handler, Default_Handler

.weak GPIO_A_9_Handler
.thumb_set GPIO_A_9_Handler, Default_Handler

.weak GPIO_A_16_Handler
.thumb_set GPIO_A_16_Handler, Default_Handler

.weak GPIO_A_2to7_Handler
.thumb_set GPIO_A_2to7_Handler, Default_Handler

.weak GPIO_A_8_10to15_Handler
.thumb_set GPIO_A_8_10to15_Handler, Default_Handler

.weak GPIO_A_17to23_Handler
.thumb_set GPIO_A_17to23_Handler, Default_Handler

.weak GPIO_A_24to31_Handler
.thumb_set GPIO_A_24to31_Handler, Default_Handler

.weak GPIO_B_0to7_Handler
.thumb_set GPIO_B_0to7_Handler, Default_Handler

.weak GPIO_B_8to15_Handler
.thumb_set GPIO_B_8to15_Handler, Default_Handler

.weak GPIO_B_16to23_Handler
.thumb_set GPIO_B_16to23_Handler, Default_Handler

.weak GPIO_B_24to31_Handler
.thumb_set GPIO_B_24to31_Handler, Default_Handler

.weak UART3_Handler
.thumb_set UART3_Handler, Default_Handler

.weak SPI2_Handler
.thumb_set SPI2_Handler, Default_Handler

.weak I2C2_Handler
.thumb_set I2C2_Handler, Default_Handler

.weak DSP_Event_1_Handler
.thumb_set DSP_Event_1_Handler, Default_Handler

.weak DSP_Event_2_Handler
.thumb_set DSP_Event_2_Handler, Default_Handler

.weak SHA256_Handler
.thumb_set SHA256_Handler, Default_Handler

.weak USB_ISOC_Handler
.thumb_set USB_ISOC_Handler, Default_Handler

.weak BT_CLK_compare_Handler
.thumb_set BT_CLK_compare_Handler, Default_Handler

.weak HW_RSA_Handler
.thumb_set HW_RSA_Handler, Default_Handler

.weak PSRAM_Handler
.thumb_set PSRAM_Handler, Default_Handler

.weak Compare_clk_4_Handler
.thumb_set Compare_clk_4_Handler, Default_Handler

.weak Compare_clk_5_Handler
.thumb_set Compare_clk_5_Handler, Default_Handler

.weak dspdma_int_all_host_Handler
.thumb_set dspdma_int_all_host_Handler, Default_Handler

.weak NNA_Handler
.thumb_set NNA_Handler, Default_Handler

.weak Compare_clk_9_Handler
.thumb_set Compare_clk_9_Handler, Default_Handler

.weak Compare_clk_10_Handler
.thumb_set Compare_clk_10_Handler, Default_Handler

.weak GPIO_C_0to7_Handler
.thumb_set GPIO_C_0to7_Handler, Default_Handler

.weak GPIO_C_8to15_Handler
.thumb_set GPIO_C_8to15_Handler, Default_Handler

.weak Reserved_Handler_6
.thumb_set Reserved_Handler_6, Default_Handler

.weak Reserved_Handler_7
.thumb_set Reserved_Handler_7, Default_Handler

.weak TIM8_Handler
.thumb_set TIM8_Handler, Default_Handler

.weak TIM9_Handler
.thumb_set TIM9_Handler, Default_Handler

.weak TIM10_Handler
.thumb_set TIM10_Handler, Default_Handler

.weak TIM11_Handler
.thumb_set TIM11_Handler, Default_Handler

.weak TIM12_Handler
.thumb_set TIM12_Handler, Default_Handler

.weak TIM13_Handler
.thumb_set TIM13_Handler, Default_Handler

.weak TIM14_Handler
.thumb_set TIM14_Handler, Default_Handler

.weak TIM15_Handler
.thumb_set TIM15_Handler, Default_Handler

.weak SPIC0_Handler
.thumb_set SPIC0_Handler, Default_Handler

.weak SPIC1_Handler
.thumb_set SPIC1_Handler, Default_Handler

.weak SPIC2_Handler
.thumb_set SPIC2_Handler, Default_Handler

.weak SPIC3_Handler
.thumb_set SPIC3_Handler, Default_Handler

.weak SDIO_HOST_Handler
.thumb_set SDIO_HOST_Handler, Default_Handler

.weak SPIC4_Handler
.thumb_set SPIC4_Handler, Default_Handler

.weak ERR_CORR_CODE_Handler
.thumb_set ERR_CORR_CODE_Handler, Default_Handler

.weak SLAVE_PORT_MONITOR_Handler
.thumb_set SLAVE_PORT_MONITOR_Handler, Default_Handler

.weak RESERVED0_Handler
.thumb_set RESERVED0_Handler, Default_Handler

.weak RESERVED1_Handler
.thumb_set RESERVED1_Handler, Default_Handler

.weak RESERVED2_Handler
.thumb_set RESERVED2_Handler, Default_Handler

.weak RESERVED3_Handler
.thumb_set RESERVED3_Handler, Default_Handler

.weak RESERVED4_Handler
.thumb_set RESERVED4_Handler, Default_Handler

.weak RESERVED5_Handler
.thumb_set RESERVED5_Handler, Default_Handler

.weak RESERVED6_Handler
.thumb_set RESERVED6_Handler, Default_Handler

.weak SPDIF_Rx_Handler
.thumb_set SPDIF_Rx_Handler, Default_Handler

.weak SPDIF_Tx_Handler
.thumb_set SPDIF_Tx_Handler, Default_Handler

.weak MBIAS_MFG_DET_L_Handler
.thumb_set MBIAS_MFG_DET_L_Handler, Default_Handler

.weak SPI2W_Handler
.thumb_set SPI2W_Handler, Default_Handler

.weak LPCOMP_Handler
.thumb_set LPCOMP_Handler, Default_Handler

.weak MBIAS_VBAT_DET_Handler
.thumb_set MBIAS_VBAT_DET_Handler, Default_Handler

.weak MBIAS_ADP_DET_Handler
.thumb_set MBIAS_ADP_DET_Handler, Default_Handler

.weak HW_ASRC1_Handler
.thumb_set HW_ASRC1_Handler, Default_Handler

.weak HW_ASRC2_Handler
.thumb_set HW_ASRC2_Handler, Default_Handler

.weak VADBUF_Handler
.thumb_set VADBUF_Handler, Default_Handler

.weak PTA_Mailbox_Handler
.thumb_set PTA_Mailbox_Handler, Default_Handler

.weak DSP2MCU_Handler
.thumb_set DSP2MCU_Handler, Default_Handler

.weak SPORT2_TX_Handler
.thumb_set SPORT2_TX_Handler, Default_Handler

.weak SPORT2_RX_Handler
.thumb_set SPORT2_RX_Handler, Default_Handler

.weak SPORT3_TX_Handler
.thumb_set SPORT3_TX_Handler, Default_Handler

.weak SPORT3_RX_Handler
.thumb_set SPORT3_RX_Handler, Default_Handler

.weak VAD_Handler
.thumb_set VAD_Handler, Default_Handler

.weak ANC_Handler
.thumb_set ANC_Handler, Default_Handler

.weak SPORT0_TX_Handler
.thumb_set SPORT0_TX_Handler, Default_Handler

.weak SPORT0_RX_Handler
.thumb_set SPORT0_RX_Handler, Default_Handler

.weak SPORT1_TX_Handler
.thumb_set SPORT1_TX_Handler, Default_Handler

.weak SPORT1_RX_Handler
.thumb_set SPORT1_RX_Handler, Default_Handler

.weak USB_UTMI_SUSPEND_N_Handler
.thumb_set USB_UTMI_SUSPEND_N_Handler, Default_Handler

.weak USB_DLPS_Resume_Handler
.thumb_set USB_DLPS_Resume_Handler, Default_Handler

.weak RESERVED7_Handler
.thumb_set RESERVED7_Handler, Default_Handler

