wolaite2024/jlab-jh5003-earphone/src/mcu/rtl87x3/arm/startup_rtl87x3d_gcc.s
.weak ADP_IN_DET_Handler
.thumb_set ADP_IN_DET_Handler, Default_Handler

.weak ADP_OUT_DET_Handler
.thumb_set ADP_OUT_DET_Handler, Default_Handler

.weak GPIOA2_Handler
.thumb_set GPIOA2_Handler, Default_Handler

.weak GPIOA3_Handler
.thumb_set GPIOA3_Handler, Default_Handler

.weak GPIOA4_Handler
.thumb_set GPIOA4_Handler, Default_Handler

.weak GPIOA5_Handler
.thumb_set GPIOA5_Handler, Default_Handler

.weak GPIOA6_Handler
.thumb_set GPIOA6_Handler, Default_Handler

.weak GPIOA7_Handler
.thumb_set GPIOA7_Handler, Default_Handler

.weak GPIOA8_Handler
.thumb_set GPIOA8_Handler, Default_Handler

.weak GPIOA9_Handler
.thumb_set GPIOA9_Handler, Default_Handler

.weak GPIOA10_Handler
.thumb_set GPIOA10_Handler, Default_Handler

.weak GPIOA11_Handler
.thumb_set GPIOA11_Handler, Default_Handler

.weak GPIOA12_Handler
.thumb_set GPIOA12_Handler, Default_Handler

.weak GPIOA13_Handler
.thumb_set GPIOA13_Handler, Default_Handler

.weak GPIOA14_Handler
.thumb_set GPIOA14_Handler, Default_Handler

.weak GPIOA15_Handler
.thumb_set GPIOA15_Handler, Default_Handler

.weak GPIOA16_Handler
.thumb_set GPIOA16_Handler, Default_Handler

.weak GPIOA17_Handler
.thumb_set GPIOA17_Handler, Default_Handler

.weak GPIOA18_Handler
.thumb_set GPIOA18_Handler, Default_Handler

.weak GPIOA19_Handler
.thumb_set GPIOA19_Handler, Default_Handler

.weak GPIOA20_Handler
.thumb_set GPIOA20_Handler, Default_Handler

.weak GPIOA21_Handler
.thumb_set GPIOA21_Handler, Default_Handler

.weak GPIOA22_Handler
.thumb_set GPIOA22_Handler, Default_Handler

.weak GPIOA23_Handler
.thumb_set GPIOA23_Handler, Default_Handler

.weak GPIOA24_Handler
.thumb_set GPIOA24_Handler, Default_Handler

.weak GPIOA25_Handler
.thumb_set GPIOA25_Handler, Default_Handler

.weak GPIOA26_Handler
.thumb_set GPIOA26_Handler, Default_Handler

.weak GPIOA27_Handler
.thumb_set GPIOA27_Handler, Default_Handler

.weak GPIOA28_Handler
.thumb_set GPIOA28_Handler, Default_Handler

.weak GPIOA29_Handler
.thumb_set GPIOA29_Handler, Default_Handler

.weak GPIOA30_Handler
.thumb_set GPIOA30_Handler, Default_Handler

.weak GPIOA31_Handler
.thumb_set GPIOA31_Handler, Default_Handler

.weak GPIOB0_Handler
.thumb_set GPIOB0_Handler, Default_Handler

.weak GPIOB1_Handler
.thumb_set GPIOB1_Handler, Default_Handler

.weak GPIOB2_Handler
.thumb_set GPIOB2_Handler, Default_Handler

.weak GPIOB3_Handler
.thumb_set GPIOB3_Handler, Default_Handler

.weak GPIOB4_Handler
.thumb_set GPIOB4_Handler, Default_Handler

.weak GPIOB5_Handler
.thumb_set GPIOB5_Handler, Default_Handler

.weak GPIOB6_Handler
.thumb_set GPIOB6_Handler, Default_Handler

.weak GPIOB7_Handler
.thumb_set GPIOB7_Handler, Default_Handler

.weak GPIOB8_Handler
.thumb_set GPIOB8_Handler, Default_Handler

.weak GPIOB9_Handler
.thumb_set GPIOB9_Handler, Default_Handler

.weak GPIOB10_Handler
.thumb_set GPIOB10_Handler, Default_Handler

.weak GPIOB11_Handler
.thumb_set GPIOB11_Handler, Default_Handler

.weak GPIOB12_Handler
.thumb_set GPIOB12_Handler, Default_Handler

.weak GPIOB13_Handler
.thumb_set GPIOB13_Handler, Default_Handler

.weak GPIOB14_Handler
.thumb_set GPIOB14_Handler, Default_Handler

.weak GPIOB15_Handler
.thumb_set GPIOB15_Handler, Default_Handler

.weak GPIOB16_Handler
.thumb_set GPIOB16_Handler, Default_Handler

.weak GPIOB17_Handler
.thumb_set GPIOB17_Handler, Default_Handler

.weak GPIOB18_Handler
.thumb_set GPIOB18_Handler, Default_Handler

.weak GPIOB19_Handler
.thumb_set GPIOB19_Handler, Default_Handler

.weak GPIOB20_Handler
.thumb_set GPIOB20_Handler, Default_Handler

.weak GPIOB21_Handler
.thumb_set GPIOB21_Handler, Default_Handler

.weak GPIOB22_Handler
.thumb_set GPIOB22_Handler, Default_Handler

.weak GPIOB23_Handler
.thumb_set GPIOB23_Handler, Default_Handler

.weak GPIOB24_Handler
.thumb_set GPIOB24_Handler, Default_Handler

.weak GPIOB25_Handler
.thumb_set GPIOB25_Handler, Default_Handler

.weak GPIOB26_Handler
.thumb_set GPIOB26_Handler, Default_Handler

.weak GPIOB27_Handler
.thumb_set GPIOB27_Handler, Default_Handler

.weak GPIOB28_Handler
.thumb_set GPIOB28_Handler, Default_Handler

.weak GPIOB29_Handler
.thumb_set GPIOB29_Handler, Default_Handler

.weak GPIOB30_Handler
.thumb_set GPIOB30_Handler, Default_Handler

.weak GPIOB31_Handler
.thumb_set GPIOB31_Handler, Default_Handler

.weak GPIOC0_Handler
.thumb_set GPIOC0_Handler, Default_Handler

.weak GPIOC1_Handler
.thumb_set GPIOC1_Handler, Default_Handler

.weak GPIOC2_Handler
.thumb_set GPIOC2_Handler, Default_Handler

.weak GPIOC3_Handler
.thumb_set GPIOC3_Handler, Default_Handler

.weak GPIOC4_Handler
.thumb_set GPIOC4_Handler, Default_Handler

.weak GPIOC5_Handler
.thumb_set GPIOC5_Handler, Default_Handler

.weak GPIOC6_Handler
.thumb_set GPIOC6_Handler, Default_Handler

.weak GPIOC7_Handler
.thumb_set GPIOC7_Handler, Default_Handler

.weak GPIOC8_Handler
.thumb_set GPIOC8_Handler, Default_Handler

.weak GPIOC9_Handler
.thumb_set GPIOC9_Handler, Default_Handler

.weak GPIOC10_Handler
.thumb_set GPIOC10_Handler, Default_Handler

.weak GPIOC11_Handler
.thumb_set GPIOC11_Handler, Default_Handler

.weak GPIOC12_Handler
.thumb_set GPIOC12_Handler, Default_Handler

.weak GPIOC13_Handler
.thumb_set GPIOC13_Handler, Default_Handler

.weak GPIOC14_Handler
.thumb_set GPIOC14_Handler, Default_Handler

.weak GPIOC15_Handler
.thumb_set GPIOC15_Handler, Default_Handler

/**
**===========================================================================
**  Program - Reset_Handler
**  Abstract: This code gets called after a reset event.  
**===========================================================================
*/
  .section RESET
  .weak    Reset_Handler
  .type    Reset_Handler, %function
Reset_Handler:
    .ifdef __USE_C_LIBRARY_INIT   /* use c library init*/
    LDR    R0, =system_init
    BLX    R0
    LDR    R0, =__main
    BX     R0  
    .else
    /* write our init flow: copy rw, encrypted and clear zi
      data on rw, data on zi, buffer on rw, buffer on zi
    */
	
    /* copy data on rw */
    .extern __ram_rw_load_addr__;
    .extern __ram_rw_dst_addr__;
    .extern __ram_dataon_rw_length__;
    LDR R0, = __ram_rw_load_addr__
    LDR R1, = __ram_rw_dst_addr__
    LDR R2, =__ram_dataon_rw_length__
    
    CMP R2, #0
    BEQ end_of_copy_data_on_rw
copy_data_on_rw:
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_data_on_rw

end_of_copy_data_on_rw:

                /*clear data on zi*/
                .extern __ram_dataon_zi_start__;
                .extern __ram_dataon_zi_length__;
                LDR R0, =__ram_dataon_zi_start__
                LDR R1, =__ram_dataon_zi_length__
                CMP R1, #0
                BEQ end_of_clear_data_on_zi
clear_data_on_zi:
                STR R2, [R0]
                ADDS R0, R0, #4
                SUBS R1, R1, #4
                BNE clear_data_on_zi

end_of_clear_data_on_zi:

                /*copy buffer on ro (for ram function)*/
                .extern __ram_code_load_addr__
                .extern __ram_code_exe_addr__
                .extern __ram_code_length__
                LDR R0, =__ram_code_load_addr__
                LDR R1, =__ram_code_exe_addr__
                LDR R2, =__ram_code_length__         
                CMP R2, #0
                BEQ end_of_copy_buffer_on_ro
copy_buffer_on_ro:
                LDR R3, [R0]
                ADDS R0, R0, #4
                STR R3, [R1]
                ADDS R1, R1, #4
                SUBS R2, R2, #4
                BNE copy_buffer_on_ro                
end_of_copy_buffer_on_ro:
                .extern system_init
                .extern main                
                LDR    R0, =system_init
                BLX    R0
                LDR    R0, =main
                BX     R0

      .endif  /*end of macro __USE_C_LIBRARY_INIT*/

.end 

